Config/Documents/Закрытие23_02.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Закрытие23_02</Name>
			<Comment>Закрытие 23.02 счета</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДт20</Name>
					<Comment>Подразделение Дт 20.01</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа_20</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОборотКт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОборотКтНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1Кт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Documents/Закрытие23_02/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
//Процедура ОсновныеДействияФормыНастройка(Кнопка)
//	
//	ОбщегоНазначения.РучнаяКорректировкаОсновнаяФорма(ЭтоНовый(),Ссылка,ЭтотОбъект);
//	
//КонецПроцедуры // ДействияФормыДвиженияДокументаПоРегистрам()

Функция СформироватьЗапросПоСч23()
	
	Запрос = Новый Запрос;
	
	Дата = Объект.Дата;
	Организация = Объект.Организация;

	Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Счет",ПланыСчетов.Хозрасчетный.РасходыПоАвтомойкеКосв);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
	|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , , , , , ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Организация = &Организация
	|	И ХозрасчетныйОбороты.Счет = &Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Субконто1";
	
	Возврат Запрос;	
	
КонецФункции

Процедура ДатаПриИзменении(Элемент)
	
	Дата = КонецМесяца(Дата);
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьНаСервере()
	
	Коэффициент = Объект.Коэффициент;
	НоменклатурнаяГруппа_20 = Объект.НоменклатурнаяГруппа_20;
	ПодразделениеДт20 = Объект.ПодразделениеДт20;
	ТабЧасть = Объект.ТабЧасть;
	Организация = Объект.Организация;

	Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана организация !");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если ПодразделениеДт20 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрано подразделение Дт 20.01 счета !");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если НоменклатурнаяГруппа_20 = Справочники.НоменклатурныеГруппы.ПустаяСсылка() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не выбрана номенклатурная группа Дт 20.01 счета !");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Коэффициент=0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("Не заполнен коэффициент распределения !");
		Сообщение.Сообщить();
	КонецЕсли;	
	
	ТабЧасть.Очистить();
	
	Сч23_01 = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводстваКосв;
	Сч20_01 = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
	Запрос = СформироватьЗапросПоСч23();
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТабЧасти = ТабЧасть.Добавить();                   //Дт 23_01 Кт 23_02
		СтрокаТабЧасти.СчетДт = Сч23_01;
		СтрокаТабЧасти.ПодразделениеДт = Выборка.Подразделение;
		СтрокаТабЧасти.ПодразделениеКт = Выборка.Подразделение; 
		СтрокаТабЧасти.Субконто1 = Выборка.Субконто1;
		СтрокаТабЧасти.Субконто1Кт = Выборка.Субконто1;
		СуммаРаспр = Окр(Выборка.СуммаОборотДт * Коэффициент,2); 
		СтрокаТабЧасти.СуммаОборотКт = СуммаРаспр;
		СуммаРаспрНУ = Окр(Выборка.СуммаНУОборотДт * Коэффициент,2);
		СтрокаТабЧасти.СуммаОборотКтНУ = СуммаРаспрНУ;
		СтрокаТабЧасти = ТабЧасть.Добавить();                   //Дт 20_01 Кт 23_02  
		СтрокаТабЧасти.СчетДт = Сч20_01;
		СтрокаТабЧасти.ПодразделениеДт = ПодразделениеДт20;
		СтрокаТабЧасти.ПодразделениеКт = Выборка.Подразделение; 
		СтрокаТабЧасти.Субконто1 = НоменклатурнаяГруппа_20;
		СтрокаТабЧасти.Субконто2 = Выборка.Субконто1;
		СтрокаТабЧасти.Субконто1Кт = Выборка.Субконто1;
		СтрокаТабЧасти.СуммаОборотКт = Выборка.СуммаОборотДт - СуммаРаспр ; 
		СтрокаТабЧасти.СуммаОборотКтНУ = Выборка.СуммаНУОборотДт - СуммаРаспрНУ;  
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьНаСервере();
КонецПроцедуры
